my-pc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>If you happen to sit on my computer&hellip;</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="If you happen to sit on my computer&hellip;"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-23T17:43+0200"/>
<meta name="author" content="Andrey Kotlarski"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/worg-classic.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">If you happen to sit on my computer&hellip;</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Ahtung, Ahtung - a very customized environment may be in front of you!</a></li>
<li><a href="#sec-2">2 Colemak</a></li>
<li><a href="#sec-3">3 XMonad</a></li>
<li><a href="#sec-4">4 Emacs</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ahtung, Ahtung - a very customized environment may be in front of you!</h2>
<div class="outline-text-2" id="text-1">


<p>
Read on to see how to get started.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Colemak</h2>
<div class="outline-text-2" id="text-2">


<p>
Firstly, <a href="http://colemak.com">Colemak</a> keyboard layout is used by default.  If this is
unsuitable, you can switch to other layouts with the &lt;menu&gt; button
(somewhere between right &lt;alt&gt; and &lt;ctrl&gt;).
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> XMonad</h2>
<div class="outline-text-2" id="text-3">


<p>
Secondly, the <a href="http://xmonad.org">XMonad</a> window manager is employed.  Here's a brief
description of important keyboard shortcuts to get you going.  Mod
corresponds to the left windows key and + is a composition of key
presses on "standard" (qwerty) keyboard layout:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key combination</th><th scope="col" class="left">Action</th></tr>
<tr><th scope="col" class="left">starting with Mod</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="left">1&hellip;9</td><td class="left">switch to respective virtual desktop from 1 to 9</td></tr>
<tr><td class="left">&lt;shift&gt; + 1&hellip;9</td><td class="left">move current application window (surrounded by green edges)</td></tr>
<tr><td class="left"></td><td class="left">to respective virtual desktop from 1 to 9</td></tr>
<tr><td class="left">&lt;space&gt;</td><td class="left">toggle layout for current virtual desktop</td></tr>
<tr><td class="left">&lt;shift&gt; + c</td><td class="left">close current application window</td></tr>
<tr><td class="left">&lt;Left Mouse Button&gt; dragging</td><td class="left">move window under the mouse cursor (taking it out of tiling)</td></tr>
<tr><td class="left">&lt;Right Mouse Button&gt; dragging</td><td class="left">change size of the window under the mouse cursor (taking it out of tiling)</td></tr>
<tr><td class="left">t (g on qwerty)</td><td class="left">push current application window back to tiling</td></tr>
<tr><td class="left">b</td><td class="left">toggle taskbar visibility</td></tr>
<tr><td class="left">u (u on qwerty)</td><td class="left">launch shell prompt to start a program by name (use &lt;tab&gt; for completion)</td></tr>
<tr><td class="left">g (d on qwerty)</td><td class="left">launch a menu of currently opened application windows on all virtual desktops</td></tr>
<tr><td class="left"></td><td class="left">and choose one to visit by using arrows and &lt;enter&gt;</td></tr>
<tr><td class="left">&lt;shift&gt; + &lt;enter&gt;</td><td class="left">launch terminal</td></tr>
<tr><td class="left">k (e on qwerty)</td><td class="left">focus the next application window</td></tr>
<tr><td class="left">j (n on qwerty)</td><td class="left">focus the previous application window</td></tr>
<tr><td class="left">l (i on qwerty)</td><td class="left">grow master area (normally on the left)</td></tr>
<tr><td class="left">h</td><td class="left">shrink master area</td></tr>
<tr><td class="left">,</td><td class="left">increment number of windows in the master area</td></tr>
<tr><td class="left">.</td><td class="left">decrement number of windows in the master area</td></tr>
<tr><td class="left">q</td><td class="left">restart XMonad</td></tr>
<tr><td class="left">&lt;shift&gt; + q</td><td class="left">quit XMonad</td></tr>
</tbody>
</table>


<p>
Note that if you change keyboard layout to US qwerty, you'll have to
use keys in the parenthesis where noted.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Emacs</h2>
<div class="outline-text-2" id="text-4">


<p>
Lastly, <a href="http://www.gnu.org/software/emacs">GNU Emacs</a> is actually my operating system and kitchen sink.
I'm also sort of minimalist, thus don't be surprised to see some
graphical (and not only) programs missing.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-23T17:43+0200</p>
<p class="author">Author: Andrey Kotlarski</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
